Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_DevelopiOSAppsSwift/DevelopiOSAppsSwift-level2.tmx
Source language: en_us
Languages: ja

source: An additional piece of information that must be passed into a function, method, or initializer when it’s called.
ja: 追加的な一片の情報、それは、関数、メソッド、またはイニシャライザが呼び出される時にそれに渡されなければなりません。

source: An app in Xcode that simulates the behavior and appearance of running an app on a device.
ja: Xcodeのアプリのひとつ、それは、ある機器上でのあるアプリの実行の挙動や外観をシミュレートします（擬似的に作り出します）。

source: An area in Xcode that displays inspectors, such as the Attributes inspector, Identity inspector, and Size inspector.
ja: Xcodeの１区画、それは、インスペクタを表示します、例えば属性インスペクタ、同一性インスペクタ、そしてサイズインスペクタなど。

source: An area in Xcode that displays one of the ready-to-use libraries of resources for your project, like the Object library.
ja: Xcodeの１区画、それはあなたのプロジェクト用の即時利用可能なリソースのライブラリの１つを表示します、例えばオブジェクトライブラリのような。

source: An area in Xcode that displays the inspector pane and library pane.
ja: Xcodeの１区画、それは、インスペクタ枠とライブラリ枠を表示します。

source: An empty image view doesn’t have an intrinsic content size.
ja: 空のイメージビューは固有コンテンツサイズを持ちません。

source: An event processing loop that you use to schedule work and coordinate the receipt of incoming events in your app.
ja: イベント処理ループ、あなたはそれを使って、あなたのアプリの作業予定を立て、やってくるイベントの受け取りの調整をします。

source: An image picker controller manages the user interface for taking pictures and for choosing saved images to use in your app.
ja: イメージピッカーコントローラは、あなたのアプリで使えるように、画像の取得や保存された画像の選択のためのユーザインターフェイスを管理します。

source: An image set represents a single image asset, but can contain different versions of the image to display at different screen resolutions.
ja: 画像セットはただ１つだけ画像資産を表示します、しかし異なるバージョンの画像を含むことで異なる画面解像度で表示することができます。

source: An image view isn’t a control, so it’s not designed to respond to input in the same way that button or a slider might.
ja: イメージビューは、コントロールではありません、それでそれはボタンやスライダがするのと同じ方法で入力に応答するように設計されません。

source: An inspector that you use to customize visual attributes of a user interface (UI) element in a storyboard.
ja: インスペクタのひとつ、あなたはそれを使って、ストーリーボードの中のユーザインターフェイス（UI）の視覚的属性を好みに合わせて変更します。

source: An inspector that you use to edit properties of an object in a storyboard related to that object’s identity, such as what class the object belongs to.
ja: あるインスペクタ、あなたはそれを使ってストーリーボードの中のオブジェクトのプロパティを、そのオブジェクトの同一性（アイデンティティ）に関して編集します、例えばどのクラスにそのオブジェクトが帰属するかなど。

source: An inspector that you use to edit the size and position of a user interface (UI) element in a storyboard.
ja: １つのインスペクタ、それは、あなたがストーリーボードの中のユーザインターフェイス（UI）要素の大きさと位置を編集するために使うものです。

source: An object of the UIViewController class (and its subclasses) comes with a set of methods that manage its view hierarchy.
ja: UIViewControllerクラス（およびそれのサブクラス）のあるオブジェクトは、ひと揃いのメソッドを備えていて、それらはそれのビュー階層を管理します。

source: An operator (!) placed after an optional value to access its underlying value.
ja: オプショナル値の後に置かれて、それの内在する値にアクセスするようにする演算子（!）。

source: An operator (...) that lets you create a range of numbers that includes both the lower and upper values.
ja: ある演算子（...）、それは、あなたにある数の範囲を、下部と上部の値の両方を含めて作成させます。

source: An operator (..<) that lets you create a range of numbers that includes the lower but not the upper value.
ja: ある演算子（..<）、それは、あなたにある範囲の数を作成させます、それは低い方を含みますが高い方の値は含みません。

source: An operator (===) that tests whether two object references both refer to the same object instance.
ja: ある演算子（===）、それは２つのオブジェクトオブジェクト参照が両方とも同じインスタンスに言及するかを試験します。

source: An operator (??) placed between two values, a ?? b, that unwraps an optional a if it contains a value, or returns a default value b if a is nil.
ja: ある演算子（??）で２つの値の間、a ?? bに置かれます、それはオプショナルaをそれが値を含むならばアンラップします、またはaがnilならば値bを返します。

source: An operator (as!) that attempts a downcast and force-unwraps the result.
ja: ある演算子（as!）、それはダウンキャストとその値の強制アンラップを試みます。

source: An operator (as?) that attempts a downcast and returns the result as an optional value.
ja: ある演算子（as?）、それはダウンキャストを試みてその結果をオプショナル値として返します。

source: And just as you need a text field delegate when you work with a text field, you need an image picker controller delegate to work with an image picker controller.
ja: そしてまさにテキスト欄を扱うときにあなたがテキスト欄委任先を必要としたように、イメージピッカーコントローラを扱うのにあなたはイメージピッカーコントローラ委任先を必要とします。

source: And your loadSampleMeals() method should look something like this:
ja: あなたのloadSampleMeals()メソッドはこのようなものに見えるはずです：

source: And your tableView(_:commit:forRowAt:) method should look like this:
ja: そしてあなたのtableView(_:commit:forRowAt:)メソッドはこのように見えるはずです：

source: And your textFieldDidEndEditing(_:) method should look like this:
ja: そしてあなたのtextFieldDidEndEditing(_:)メソッドはこのように見えるはずです：

source: Anticipate object behavior based on the UIView/UIControl class hierarchy
ja: オブジェクト挙動をUIView/UIControlクラス階層に基づいて先取りする

source: Any object can serve as a delegate for another object as long as it conforms to the appropriate protocol.
ja: どんなオブジェクトでも、それが適切なプロトコルに準拠しさえすれば、他のオブジェクトの委任先としての務めを果たすことができます。

source: Archived objects can be stored on disk and retrieved at a later time.
ja: アーカイブされたオブジェクトは、ディスクに保管され後で取り出されることができます。

source: As a convenience initializer, this initializer is required to call one of its class’s designated initializers before completing.
ja: 便宜イニシャライザであるので、このイニシャライザは、作業を完了する前にそれのクラスの指定イニシャライザの一つを呼ぶ必要があります。

source: As a result of the text field becoming the first responder, iOS displays the keyboard and begins an editing session for that text field.
ja: テキスト欄がファーストレスポンダになることの結果として、iOSはキーボードを表示してそのテキスト欄のために編集セッションを始めます。

source: As a result, it’s hard to tell whether you’ve implemented everything correctly, and if you might encounter edge cases that you haven’t considered at runtime.
ja: その結果、あなたが何もかもを正しく実装したかどうか、そしてあなたが考慮しなかったエッジケース（特殊な事例）に実行時に出くわしすことがあるかは、知り難いことです。

source: As a result, the warnings and errors are now gone.
ja: 結果として、警告とエラーは今では去りました。

source: As a result, when the table view reappears, the row that the user selected now shows the edited meal.
ja: 結果として、テーブルビューが再度現れる時、ユーザが選択した列は今では編集済みの食事を示します。

source: As a result, you need to distinguish between when you are presenting the view controller modally (adding a meal) and pushing the view controller onto the navigation stack (editing a meal).
ja: 結果として、あなたはあなたがビューコントローラをモーダルに提示している（食事を加えている）そしてビューコントローラをナビゲーションスタック上へとプッシュしている（食事を編集している）場合の間を区別する必要があります。

source: As before, Xcode adds a navigation controller and shows the navigation bar at the top of the meal detail scene.
ja: 前と同じように、Xcodeはナビゲーションコントローラを加えてナビゲーションバーを食事詳細シーンの上部に表示します。

source: As implied by their name, it’s important to keep unit tests modular.
ja: その名前でほのめかされるように、ユニットテストのモジュール化を保つことは重要です。

source: As is the case with most selectable elements in a storyboard, you can use the Attributes inspector to edit a segue’s attributes.
ja: ストーリーボードの中のほとんどの選択可能な要素と同じく、あなたはAttributesインスペクタを使ってセグエの属性を編集することができます。

source: As long as the superview remains alive and in memory, all of the subviews remain alive as well.
ja: スーパービューが生存してメモリにとどまる限り、すべてのサブビューは同様に生存したままでいます。

source: As soon as Xcode launches, the welcome window appears.
ja: Xcodeが起動するとすぐ、ウェルカムウインドウが現れます。

source: As soon as you add an image to a view, its intrinsic content size is set to the image’s size.
ja: あなたが画像をビューに加えるやいなや、それの固有コンテンツサイズはその画像の大きさへ設定されます。

source: As soon as you have the index path, you can look up the meal object for that path and pass it to the destination view controller.
ja: あなたがインデックスパスを得るや否や、あなたはそのパスに対する食事オブジェクトを捜して、それを行先ビューコントローラに渡すことができます。

source: As the constant name isPresentingInAddMealMode indicates, this means that the meal detail scene is presented by the user tapping the Add button.
ja: 定数名isPresentingInAddMealModeが示すように、これはユーザがAddボタンをタップすることによってその食事詳細シーンが表されたことを意味します。

source: As the initializer’s arguments, you pass in the values of the constants you created while archiving the saved data.
ja: このイニシャライザの引数として、あなたは、保存された値をアーカイブしている間にあなたが作成した定数の値を渡します。

source: As you build more complex apps, you’ll create more scenes, and will need to manage loading and unloading views as they’re moved on and off the screen.
ja: あなたがより複雑なアプリを作るとき、あなたはもっとシーンを作成するでしょう、そしてビューのロードとアンロードをそれらが画面に現れたり隠れたりするときに管理する必要があるでしょう。

source: As you can see in the ViewController.swift file, the template’s implementation overrides both the viewDidLoad() and didReceiveMemoryWarning() methods; however, the template’s stub implementation doesn’t do anything yet, except call the UIViewController version of these methods.
ja: ViewController.swiftファイルの中であなたが見ることができるように、この雛形の持つ実装はviewDidLoad()とdidReceiveMemoryWarning()メソッドの両方をオーバーライドします；しかしながら、雛形の持つスダブ実装はまだ何もしません、これらのメソッドのUIViewController版を呼び出す以外は。

source: As you create each button, you add it to the ratingButtons array to keep track of it.
ja: あなたが各ボタンを作成するとき、あなたはそれをratingButtons配列に加えてそれの最新の状態を把握するようにします。

source: As you develop your interface, you can change the canvas’s view, letting you see how your interface adapts to different size screens.
ja: あなたがあなたのインターフェイスを開発するにつれて、あなたはキャンバスのビューを変更することができ、あなたのインターフェイスが異なるサイズの画面にどう適応するかをあなたが見れるようにします。

source: As you keep the MVC pattern in mind for rest of the app’s design, it’s time to take your basic user interface to the next level, and add an image to the meal scene.
ja: あなたがこのアプリの設計の残りに向けてMVCパターンを覚えたところで、あなたの基本ユーザインターフェイスを次のレベルに持っていき、食事シーンに画像を加えるときです。

source: As you make your way through the lessons and build the app, you’ll learn about concepts in iOS app development, gain a deeper understanding of the Swift programming language, and familiarize yourself with the many valuable features of Xcode, Apple’s integrated development environment (IDE).
ja: あなたがレッスンを通して歩を進めこのアプリを作成するにつれ、あなたはiOSアプリ開発における概念について学び、Swiftプログラミング言語のより深い理解を獲得し、そしてAppleの統合開発環境（IDE）である、Xcodeの多くの価値ある特徴に精通するでしょう。

source: As you might guess, this code sets the label’s text property to Default Text.
ja: あなたが考えたように、このコードはラベルのtextプロパティを「Default Text」に設定します。

source: As you prepare to implement navigation in the FoodTracker app, you need to delete and replace a few pieces of code and parts of the user interface that you won’t need anymore.
ja: あなたがFoodTrackerアプリにおいてナビゲーションを実装する準備をする際に、あなたが必要とするのはいくつかのコード部分とユーザインターフェイスの一部を削除し置き換えることです、それはあなたがもう必要としないものです。

source: As you saw earlier, the selected state affects the button’s appearance.
ja: あなたが前に見たように、選択済状態はボタンの外観に影響します。

source: As you see in the assistant editor, the preview looks almost identical to the canvas.
ja: あなたがアシスタントエディタで見ると、プレビューはキャンバスとほとんど同一に見えます。

source: As you see, unit testing helps catch errors in your code.
ja: あなたが見たように、ユニットテストはあなたのコードのエラーをとらえる助けとなります。

source: As you will see in later lessons, failable initializers are harder to use because you need to unwrap the returned optional before using it.
ja: あなたが後のレッスンで見るように、失敗できるイニシャライザは使うのが難しいです、なぜならあなたは返されるオプショナルをそれが使われる前にアンラップする必要があるからです。

source: At runtime, your app loads the view from the storyboard.
ja: 実行時に、あなたのアプリはビューをストーリボードからロードします。

source: At runtime, your storyboard creates an instance of ViewController, your custom view controller subclass.
ja: 実行時に、あなたのストーリーボードはViewControllerのインスタンス、あなたのあつらえのビューコントローラサブクラス、を作成します。

source: At the beginning of the first if statement, add this if statement:
ja: 最初のif文の始まりで、このif文を加えてください：

source: At the end of the lesson, you’ll be able to:
ja: このレッスンの終わりに、あなたが出来るようになるのは：

source: At the end of the lesson, you’ll have a complete navigation scheme and interaction flow for the app.
ja: このレッスンの終わりには、あなたはアプリのための完全なナビゲーションの枠組みと相互作用の流れを獲得するしょう。

source: At the top of each view hierarchy is a content view.
ja: 各ビュー階層の最上部にはコンテンツビューがあります。

source: At the top of the dialog that appears, select iOS, and then select Cocoa Touch Class.
ja: 現れたダイアログの一番上で、iOSを選択して、それからCocoa Touch Classを選択してください。

source: At the top of the dialog that appears, select iOS.
ja: 現れたダイアログの一番上で、iOSを選択してください。

source: At the top of the file, immediately following the import of UIKit, import the unified logging system.
ja: ファイルの一番上で、UIKitのインポートにすぐ続けて、統合ログシステムをインポートしてください。

source: At the top of the file, import the unified logging system, just below where you import UIKit.
ja: ファイルの最上部で、統合ログシステムをインポートしてください、あなたがUIKitをインポートするところのすぐ下です。

source: At the top of the file, under import UIKit, add the following:
ja: ファイルの一番上で、import UIKitの下に、以下を加えてください：

source: At this point, the app displays an initial list of sample meals, and lets you add new meals to the list.
ja: この時点で、アプリは見本の食事の初期リストを表示して、あなたに新しい食事をそのリストに追加させます。

source: At this point, the storyboard in your app contains one scene, which represents a screen of content in your app.
ja: この時点で、あなたのアプリのストーリーボードは１つのシーン（場面）を含んでいます、それはあなたのアプリのコンテンツの画面のひとつを表します。

source: At this point, users can reset the meal name label to a default value, but you really want to let users enter their own meal names using the text field.
ja: この時点で、ユーザは食事名を省略時の値にリセットできます、しかしあなたが本当に望むのはユーザに彼ら自身の食事名をテキスト欄を使って入力されることです。

source: At this point, you can go back to the action method you defined, selectImageFromPhotoLibrary(_:), and finish its implementation.
ja: この時点で、あなたはあなたの定義したアクションメソッド、selectImageFromPhotoLibrary(_:)に戻って、それの実装を完了することができます。

source: At this point, you have a data model for a meal: the Meal class.
ja: この時点で、あなたはある食事に対するデータモデル：Mealクラスを持ちます。

source: At this point, your ViewController.swift code should look something like this:
ja: この時点で、あなたのViewController.swiftコードはこのようなものに見えるはずです：

source: At this point, your init?(name: String, photo: UIImage?, rating: Int) initializer should look like this:
ja: この時点で、あなたのinit?(name: String, photo: UIImage?, rating: Int)イニシャライザはこのように見えるはずです：

source: At this point, your custom table view controller subclass, MealTableViewController, has a mutable array that’s prepopulated with some sample meals.
ja: この時点で、あなたのカスタムテーブルビューコントローラサブクラス、MealTableViewControllerは、可変の配列を１つ持ちます、それはいくつかの見本の食事が入れられています。

source: At this point, your scene should look something like this:
ja: この時点で、あなたのシーンはこのようなものに見えるはずです：

source: At this point, you’re ready to start developing your first full-featured app.
ja: この時点で、あなたはあなたの最初の完全な機能を持ったアプリの開発を始める用意ができています。

source: At this point, you’ve got the basics of a custom UIStackView subclass, called RatingControl.
ja: この時点で、あなたは基本的なカスタムUIStackViewサブクラス、RatingControlと呼ばれるものを手に入れています。

source: Attach a tap gesture recognizer (UITapGestureRecognizer) to the image view, which will recognize when a user has tapped the image view.
ja: タップジェスチャリコグナイザ（UITapGestureRecognizer）をイメージビューに取り付けます、それは、ユーザがイメージビューをタップしたときを認識します。

source: Attributes inspector
ja: Attributes（属性）インスペクタ

source: Auto Layout
ja: 自動レイアウト

source: Auto Layout dynamically calculates the size and position of each element based on these constraints.
ja: 自動レイアウトは、各要素の大きさと位置をそれらの制約に基づいて動的に計算します。

source: Be sure to reset these settings to their default values when you are done testing them.
ja: これらの設定をそれらの省略時の値に設定し直すことをあなたがそれらのテストを終えた時に確実にしてください。

source: Because MealTableViewController is a subclass of UITableViewController, the template implementation comes with a skeleton for prepare(for:sender:).
ja: MealTableViewControllerがUITableViewControllerのサブクラスであることから、雛形実装はprepare(for:sender:)のための骨格を備えています。

source: Because ViewController will be in charge of presenting the image picker controller, it also needs to adopt the UINavigationControllerDelegate protocol, which simply lets ViewController take on some basic navigation responsibilities.
ja: なぜならViewControllerは、イメージピッカーコントローラに起こっていることを管理することになるからです、それはまたUINavigationControllerDelegateプロトコルに準拠することもまた必要とします、それは単純にViewControllerがいくつかの基本的なナビゲーション責務を持つようにします。

source: Because a meal always has a name and rating but might not have a photo, make the UIImage an optional.
ja: 食事は、常に名前と格付けを持つが写真を持つとは限らないことから、UIImageをオプショナルにしてください。

source: Because editing a meal and creating a new meal are very similar, the app uses the meal detail scene for both.
ja: 食事の編集および新しい食事の作成は大変似ていることから、アプリは両方のために食事詳細シーンを使います。

source: Because the Meal class’s init!(name:, photo:, rating:) initializer is failable, you need to check the result returned by the initializer.
ja: Mealクラスのinit!(name:, photo:, rating:)イニシャライザが失敗できることから、あなたはイニシャライザによって返される結果を検査する必要があります。

source: Because the meal property on MealViewController is an optional and you set your initializer up to fail if there’s no name, the Meal object doesn’t get created and added to the meal list—which is what you expect to happen.
ja: MealViewController上のmealプロパティがオプショナルであり、あなたが名前なしでは失敗するようにあなたのイニシャライザを設定したので、Mealオブジェクトは作成されず食事リストに加えられません—これはあなたが起こることを期待するものです。

source: Because the NSObject class’s only initializer is init(), the Swift compiler adds the call for you automatically, so you don’t need to change your code; however, feel free to add a call to super.init(), if you wish.
ja: NSObjectクラスのただ１つのイニシャライザはinit()であることから、Swiftコンパイラはあなたの代わりに自動的に呼び出しを加えます、それであなたはあなたのコードを変更する必要はありません；しかしながら、遠慮なくsuper.init()への呼び出しを加えてください、あなたが望むなら。

source: Because the return value of decodeIntegerForKey is Int, there’s no need to downcast the decoded value and there is no optional to unwrap.
ja: decodeIntegerForKeyの戻り値がIntであることから、復号化された値をダウンキャストする必要はありません、そしてオプショナルをアンラップすることはありません。

source: Because the text field will no longer be the active object in the app, events need to get routed to a more appropriate object.
ja: テキスト欄がもはやアプリにおいて能動的なオブジェクトでないことから、イペントはより適したオブジェクトへ向けられる必要があります。

source: Because the user, rather than the developer, is in control of when certain pieces of the app code get executed, you want to identify exactly which actions a user can perform and what happens in response to those actions.
ja: 開発者ではなくユーザがいつアプリのコードの特定の部分が実行されるようにするかを制御するので、あなたは、厳密にどのアクションがユーザに実行可能かそして何がそれらのアクションへの応答において起こるかを明確にする必要があります。

source: Because the “Constrain to margins” checkbox is selected, the stack view in this case will be constrained to the superview’s left and right margins.
ja: 「Constrain to margins」チェックボックスが選択されているため、この場合のスタックビューは、それのスーパービューの左および右余白に対して制約されています。

source: Because you based your project on an Xcode template, the basic app environment is automatically set up for you.
ja: あなたは、Xcodeひな形をもとにあなたのプロジェクトを構築したので、基本的なアプリ環境は自動的にあなたの代わりに準備されます。

source: Because you created a custom cell class that you want to use, downcast the type of the cell to your custom cell subclass, MealTableViewCell.
ja: あなたは使いたいと望むカスタムセルクラスを作成したので、セルの型をあなたのカスタムセルサブクラス、MealTableViewCellにダウンキャストしてください。

source: Because you don’t need to do anything else, you indicate that you don’t need to execute a completion handler by passing in nil.
ja: あなたは何もする必要はないので、あなたが完了ハンドラを実行する必要がないことをnilを渡すことによって示します。

source: Because you haven’t written any performance-heavy code, you’ll only want to write functional tests for now.
ja: あなたが何ら性能上重いコードを書いていないので、あなたはただ機能テストだけを今のところ書きたいでしょう。

source: Because you now have two view controllers in your project, it makes sense to give ViewController.swift a more meaningful name.
ja: あなたは現在２つのビューコントローラをあなたのプロジェクトの中に持つため、ViewController.swiftにより理解しやすい名前を与えるほうが賢明です。

source: Because you resign first responder status in textFieldShouldReturn, the system calls this method just after calling textFieldShouldReturn.
ja: あなたはファーストレスポンダ状態をtextFieldShouldReturnにおいて放棄するので、システムはこのメソッドをtextFieldShouldReturnの呼び出しの直後に呼び出します。

source: Because you want to unwind back to the meal list scene, you need to add an action method with this format to MealTableViewController.swift.
ja: あなたは食事リストシーンへと巻き戻し帰りたいので、あなたに必要なのはこの形式を使ったアクションメソッドをMealTableViewController.swiftに加えることです。

source: Because you’re using a navigation controller with a show segue, the backward navigation is handled for you, and a back button automatically appears in the meal detail scene.
ja: あなたがナビゲーションコントローラを表示セグエとともに使っいてるので、後方へのナビゲーションはあなたに代わって取り扱われます、そして戻るボタンが自動的に食事詳細シーンに現れます。

source: Before creating a segue, you need to configure your scenes.
ja: セグエの作成の前に、あなたは、あなたのシーンを構成することを必要とします。

source: Before the //MARK: Private Methods section, add the following line:
ja: //MARK: Private Methods節の前に、以下の行を加えてください：

source: Before the last closing curly brace (}), add the following line:
ja: 最後の閉じ波括弧（}）の前に、以下の行を加えてください：

source: Before the last curly brace (}), add the following:
ja: 最後の波括弧（}）の前に、以下を加えてください：

source: Before you always called the dismiss(animated:completion:) method when the user tapped the Cancel button; however, dismiss(animated:completion:) only works when the user is adding a new meal.
ja: 今まであたなは常にdismiss(animated:completion:)メソッドをユーザがCancelボタンをタップした時に呼び出しました；しかしながら、dismiss(animated:completion:)はユーザが新しい食事を加える時に働くだけです。

source: Before you can display dynamic data in your table view cells, you need to create outlet connections between the prototype in your storyboard and the code that represents the table view cell in MealTableViewCell.swift.
ja: 動的データをあなたのテーブルビューセルの中に表示する前に、あなたが必要とするのは、アウトレット接続をあなたのストーリーボードの中の原型とテーブルビューセルをMealTableViewCell.swiftにおいて表しているコードとの間に作成することです。

source: Before you can run the app on an iOS device, you need to set a valid team so that the app can be signed.
ja: あなたがアプリをiOSデバイスで実行可能になる前に、あなたは有効なチームを設定する必要があります、それでそのアプリは署名されることができます。

source: Below the //MARK: Private Methods comment, add the following method:
ja: //MARK: Private Methodsコメントの下で、以下の行を加えてください：

source: Below the class line in MealTableViewController.swift, add the following code:
ja: MealTableViewController.swiftの中のclass行の下に、以下のコードを加えてください：

source: Below the class line, add the following:
ja: class行の下に、以下を加えてください：

source: Below the else statement, add the following code:
ja: このelse文の下で、以下のコードを加えてください：

source: Below the encodeWithCoder(_:) method, add the following initializer:
ja: encodeWithCoder(_:)メソッドの下で、以下のイニシャライザを加えてください：

source: Below the imagePickerControllerDidCancel(_:) method, add the following method:
ja: imagePickerControllerDidCancel(_:)メソッドの下に、以下のメソッドを加えてください：

source: Below the init(frame:) method, start typing init again, and select init(coder: NSCoder) from the code completion options.
ja: init(frame:)メソッドの下で、再びinitをタイプし始めて、そしてinit(coder: NSCoder)をコード補完の選択肢から選んでください。

source: Below the nameTextField.delegate line, add the following code.
ja: nameTextField.delegate行の下で、このコードを加えてください：

source: Below the ratingControl outlet in MealViewController.swift, add the following property:
ja: MealViewController.swiftにおいてratingControlアウトレットの下に、以下のプロパティを加えてください：

source: Below the super.viewDidLoad() line, add a blank line and the following:
ja: super.viewDidLoad()行の下で、空白行を１つと以下を加えてください：

source: Below the super.viewDidLoad() line, add the following line of code:
ja: super.viewDidLoad()行の下で、以下のコード行を加えてください：

source: Below the call to super.prepare(for:sender:), add the following guard statement:
ja: super.prepare(for:sender:)に対する呼び出しの下に、guard文を加えてください：

source: Below the comment that says // Delete the row from the data source, add:
ja: // Delete the row from the data sourceというコメントの下で、次を加えてください：

source: Below the comment you just added, add the following method:
ja: あなたがたった今加えたコメントの下に、以下のメソッドを加えてください：

source: Below the comment, add a new test case:
ja: このコメントの下で、新しいテスト項目を加えてください：

source: Below the comment, add the following method:
ja: そのコメントの下に、以下のメソッドを加えてください：

source: Below the comment, add this method skeleton:
ja: このコメントの下に、このメソッド骨組みを加えてください：

source: Below the comment, add this method:
ja: コメントの下で、このメソッドを加えてください：

source: Below the comment, start typing init.
ja: このコメントの下で、initの入力を始めます。

source: Below the import statement, add the following code:
ja: このインポート文の下で、以下のコードを加えてください：

source: Below the last line, add the button’s constraints:
ja: 最後の行の下、ボタンの持つ制約を加えてください：

source: Below the previous code, add the following:
ja: 以前のコードの下で、以下を加えてください：

source: Below the previous line, add this line of code:
ja: 前の行の下に、このコード行を加えてください：

source: Below the properties, add this code to declare an initializer:
ja: このプロパティの下で、このコードを加えてイニシャライザを宣言してください：

source: Below this line, add the following code:
ja: この行の下に、以下のコードを加えてください：

source: Both give you a solid foundation in the Swift programming language.
ja: 両方ともあなたにSwiftプログラミング言語におけるしっかりした基礎を与えます。
